{
    "title": "How to learn nextjs",
    "content": "Next.js was first released as an open-source project on GitHub on October 25, 2016; 6 years ago.[3] It was originally developed based on six principles: out-of-the-box functionality requiring no setup, JavaScript everywhere, all functions are written in JavaScript, automatic code-splitting and server-rendering, configurable data-fetching, anticipating requests, and simplifying deployment.[14] Next.js 2.0 was announced in March 2017 including several improvements that made it easier to work with small websites. It also increased the build efficiency and improved the scalability of the hot-module replacement feature.[15] Version 7.0 was released in September 2018 with improved error handling and support for React's context API for improved dynamic route handling. This was also the first version to upgrade to webpack 4.[16] Version 8.0 was released in February 2019 and was the first version to offer serverless deployment of applications, in which the code is split up into lambda functions that are run on demand. The version also reduced the time and resources required for static exports and improved prefetch performance.[17] Version 9.3, announced in March 2020, included various optimizations and global Sass and CSS module support.[18] On July 27, 2020 Next.js version 9.5 was announced, adding new capabilities including incremental static regeneration, rewrites, and redirect support.[19] On June 15, 2021 Next.js version 11 was released, introducing among others: Webpack 5 support, preview of real-time collaborative coding functionality, and experimental function of automatic conversion from Create React App to Next.js compatible form \"Create React App Migration\".[20] On October 26, 2021, Next.js 12 was released, adding a Rust compiler, making the compilation faster, AVIF support, Edge Functions & Middleware, and Native ESM & URL Imports.[21] On October 26, 2022, Vercel released Next.js 13. This major release brought about a new routing pattern with the addition of the app directory that includes support for layouts, React server components, streaming, and a new set of data fetching methods. Furthermore, Vercel announced a next-generation Blazingly Fast™[22] toolchain for front end development called Turbo, written in Rust consisting of three parts: Turbopack (successor to Webpack), Turborepo (incremental build system), and the Turbo engine (Blazingly Fast™ low-level incremental computation and memoization engine). The major release also includes many additional changes to the Next.js API, but most notably an introduction of a new @next/font library, changes to next/image, and an enhancement to next/link.[23]",
    "author": "Nazrul Islam",
    "metadesc": "Learn flask in few minutes. I will teach you flask in few minutes.",
    "slug": "how-to-learn-nextjs12"
}